Tekla Open API Reference for Tekla Structures 2025
CustomPartInputTypeAttribute Constructor (CustomPartBase.CustomPartInputType)
 The custom attribute uses this to store the input type to the system. This is not to be used by itself.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public CustomPartInputTypeAttribute(
	CustomPartBase.CustomPartInputType Type
)
Public Sub New (
	Type As CustomPartBase.CustomPartInputType
)
Parameters
Type
Type: Tekla.Structures.Plugins.CustomPartBase.CustomPartInputType
The custom input type.
See Also
Reference
CustomPartInputTypeAttribute Class
CustomPartInputTypeAttribute Overload
Tekla.Structures.Plugins Namespace